tutorials/tested/reactingRect2D/reactingRect2D_Simple/system/residuals
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v3.0+                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      residuals;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

residuals
    {
        functionObjectLibs ("libutilityFunctionObjects.so");
        type    residuals;
        writeControl    timeStep;
        writeInterval   1;
        fields
        (
            U
            p
	        T
	        CO
            O2
            CO2
        );
    }

